zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/supc.h
#define SUPC_WUMR_SMEN_Pos                    (1)                                            /**< (SUPC_WUMR) Supply Monitor Wakeup Enable Position */
#define SUPC_WUMR_SMEN_Msk                    (0x1U << SUPC_WUMR_SMEN_Pos)                   /**< (SUPC_WUMR) Supply Monitor Wakeup Enable Mask */
#define   SUPC_WUMR_SMEN_NOT_ENABLE_Val       (0x0U)                                         /**< (SUPC_WUMR) The supply monitor detection has no wakeup effect.  */
#define   SUPC_WUMR_SMEN_ENABLE_Val           (0x1U)                                         /**< (SUPC_WUMR) The supply monitor detection forces the wakeup of the core power supply.  */
#define SUPC_WUMR_SMEN_NOT_ENABLE             (SUPC_WUMR_SMEN_NOT_ENABLE_Val << SUPC_WUMR_SMEN_Pos)  /**< (SUPC_WUMR) The supply monitor detection has no wakeup effect. Position  */
#define SUPC_WUMR_SMEN_ENABLE                 (SUPC_WUMR_SMEN_ENABLE_Val << SUPC_WUMR_SMEN_Pos)  /**< (SUPC_WUMR) The supply monitor detection forces the wakeup of the core power supply. Position  */
#define SUPC_WUMR_RTTEN_Pos                   (2)                                            /**< (SUPC_WUMR) Real-time Timer Wakeup Enable Position */
#define SUPC_WUMR_RTTEN_Msk                   (0x1U << SUPC_WUMR_RTTEN_Pos)                  /**< (SUPC_WUMR) Real-time Timer Wakeup Enable Mask */
#define   SUPC_WUMR_RTTEN_NOT_ENABLE_Val      (0x0U)                                         /**< (SUPC_WUMR) The RTT alarm signal has no wakeup effect.  */
#define   SUPC_WUMR_RTTEN_ENABLE_Val          (0x1U)                                         /**< (SUPC_WUMR) The RTT alarm signal forces the wakeup of the core power supply.  */
#define SUPC_WUMR_RTTEN_NOT_ENABLE            (SUPC_WUMR_RTTEN_NOT_ENABLE_Val << SUPC_WUMR_RTTEN_Pos)  /**< (SUPC_WUMR) The RTT alarm signal has no wakeup effect. Position  */
#define SUPC_WUMR_RTTEN_ENABLE                (SUPC_WUMR_RTTEN_ENABLE_Val << SUPC_WUMR_RTTEN_Pos)  /**< (SUPC_WUMR) The RTT alarm signal forces the wakeup of the core power supply. Position  */
#define SUPC_WUMR_RTCEN_Pos                   (3)                                            /**< (SUPC_WUMR) Real-time Clock Wakeup Enable Position */
#define SUPC_WUMR_RTCEN_Msk                   (0x1U << SUPC_WUMR_RTCEN_Pos)                  /**< (SUPC_WUMR) Real-time Clock Wakeup Enable Mask */
#define   SUPC_WUMR_RTCEN_NOT_ENABLE_Val      (0x0U)                                         /**< (SUPC_WUMR) The RTC alarm signal has no wakeup effect.  */
#define   SUPC_WUMR_RTCEN_ENABLE_Val          (0x1U)                                         /**< (SUPC_WUMR) The RTC alarm signal forces the wakeup of the core power supply.  */
#define SUPC_WUMR_RTCEN_NOT_ENABLE            (SUPC_WUMR_RTCEN_NOT_ENABLE_Val << SUPC_WUMR_RTCEN_Pos)  /**< (SUPC_WUMR) The RTC alarm signal has no wakeup effect. Position  */
#define SUPC_WUMR_RTCEN_ENABLE                (SUPC_WUMR_RTCEN_ENABLE_Val << SUPC_WUMR_RTCEN_Pos)  /**< (SUPC_WUMR) The RTC alarm signal forces the wakeup of the core power supply. Position  */
#define SUPC_WUMR_LPDBCEN0_Pos                (5)                                            /**< (SUPC_WUMR) Low-power Debouncer Enable WKUP0 Position */
#define SUPC_WUMR_LPDBCEN0_Msk                (0x1U << SUPC_WUMR_LPDBCEN0_Pos)               /**< (SUPC_WUMR) Low-power Debouncer Enable WKUP0 Mask */
#define   SUPC_WUMR_LPDBCEN0_NOT_ENABLE_Val   (0x0U)                                         /**< (SUPC_WUMR) The WKUP0 input pin is not connected to the low-power debouncer.  */
#define   SUPC_WUMR_LPDBCEN0_ENABLE_Val       (0x1U)                                         /**< (SUPC_WUMR) The WKUP0 input pin is connected to the low-power debouncer and forces a system wakeup.  */
#define SUPC_WUMR_LPDBCEN0_NOT_ENABLE         (SUPC_WUMR_LPDBCEN0_NOT_ENABLE_Val << SUPC_WUMR_LPDBCEN0_Pos)  /**< (SUPC_WUMR) The WKUP0 input pin is not connected to the low-power debouncer. Position  */
#define SUPC_WUMR_LPDBCEN0_ENABLE             (SUPC_WUMR_LPDBCEN0_ENABLE_Val << SUPC_WUMR_LPDBCEN0_Pos)  /**< (SUPC_WUMR) The WKUP0 input pin is connected to the low-power debouncer and forces a system wakeup. Position  */
#define SUPC_WUMR_LPDBCEN1_Pos                (6)                                            /**< (SUPC_WUMR) Low-power Debouncer Enable WKUP1 Position */
#define SUPC_WUMR_LPDBCEN1_Msk                (0x1U << SUPC_WUMR_LPDBCEN1_Pos)               /**< (SUPC_WUMR) Low-power Debouncer Enable WKUP1 Mask */
#define   SUPC_WUMR_LPDBCEN1_NOT_ENABLE_Val   (0x0U)                                         /**< (SUPC_WUMR) The WKUP1 input pin is not connected to the low-power debouncer.  */
#define   SUPC_WUMR_LPDBCEN1_ENABLE_Val       (0x1U)                                         /**< (SUPC_WUMR) The WKUP1 input pin is connected to the low-power debouncer and forces a system wakeup.  */
#define SUPC_WUMR_LPDBCEN1_NOT_ENABLE         (SUPC_WUMR_LPDBCEN1_NOT_ENABLE_Val << SUPC_WUMR_LPDBCEN1_Pos)  /**< (SUPC_WUMR) The WKUP1 input pin is not connected to the low-power debouncer. Position  */
#define SUPC_WUMR_LPDBCEN1_ENABLE             (SUPC_WUMR_LPDBCEN1_ENABLE_Val << SUPC_WUMR_LPDBCEN1_Pos)  /**< (SUPC_WUMR) The WKUP1 input pin is connected to the low-power debouncer and forces a system wakeup. Position  */
#define SUPC_WUMR_LPDBCCLR_Pos                (7)                                            /**< (SUPC_WUMR) Low-power Debouncer Clear Position */
#define SUPC_WUMR_LPDBCCLR_Msk                (0x1U << SUPC_WUMR_LPDBCCLR_Pos)               /**< (SUPC_WUMR) Low-power Debouncer Clear Mask */
#define   SUPC_WUMR_LPDBCCLR_NOT_ENABLE_Val   (0x0U)                                         /**< (SUPC_WUMR) A low-power debounce event does not create an immediate clear on the first half of GPBR registers.  */
#define   SUPC_WUMR_LPDBCCLR_ENABLE_Val       (0x1U)                                         /**< (SUPC_WUMR) A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers.  */
#define SUPC_WUMR_LPDBCCLR_NOT_ENABLE         (SUPC_WUMR_LPDBCCLR_NOT_ENABLE_Val << SUPC_WUMR_LPDBCCLR_Pos)  /**< (SUPC_WUMR) A low-power debounce event does not create an immediate clear on the first half of GPBR registers. Position  */
#define SUPC_WUMR_LPDBCCLR_ENABLE             (SUPC_WUMR_LPDBCCLR_ENABLE_Val << SUPC_WUMR_LPDBCCLR_Pos)  /**< (SUPC_WUMR) A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers. Position  */
#define SUPC_WUMR_WKUPDBC_Pos                 (12)                                           /**< (SUPC_WUMR) Wakeup Inputs Debouncer Period Position */
#define SUPC_WUMR_WKUPDBC_Msk                 (0x7U << SUPC_WUMR_WKUPDBC_Pos)                /**< (SUPC_WUMR) Wakeup Inputs Debouncer Period Mask */
#define SUPC_WUMR_WKUPDBC(value)              (SUPC_WUMR_WKUPDBC_Msk & ((value) << SUPC_WUMR_WKUPDBC_Pos))
#define   SUPC_WUMR_WKUPDBC_IMMEDIATE_Val     (0x0U)                                         /**< (SUPC_WUMR) Immediate, no debouncing, detected active at least on one Slow Clock edge.  */
#define   SUPC_WUMR_WKUPDBC_3_SLCK_Val        (0x1U)                                         /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 3 SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_32_SLCK_Val       (0x2U)                                         /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 32 SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_512_SLCK_Val      (0x3U)                                         /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 512 SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_4096_SLCK_Val     (0x4U)                                         /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 4,096 SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_32768_SLCK_Val    (0x5U)                                         /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 32,768 SLCK periods  */
#define SUPC_WUMR_WKUPDBC_IMMEDIATE           (SUPC_WUMR_WKUPDBC_IMMEDIATE_Val << SUPC_WUMR_WKUPDBC_Pos)  /**< (SUPC_WUMR) Immediate, no debouncing, detected active at least on one Slow Clock edge. Position  */
#define SUPC_WUMR_WKUPDBC_3_SLCK              (SUPC_WUMR_WKUPDBC_3_SLCK_Val << SUPC_WUMR_WKUPDBC_Pos)  /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 3 SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_32_SLCK             (SUPC_WUMR_WKUPDBC_32_SLCK_Val << SUPC_WUMR_WKUPDBC_Pos)  /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 32 SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_512_SLCK            (SUPC_WUMR_WKUPDBC_512_SLCK_Val << SUPC_WUMR_WKUPDBC_Pos)  /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 512 SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_4096_SLCK           (SUPC_WUMR_WKUPDBC_4096_SLCK_Val << SUPC_WUMR_WKUPDBC_Pos)  /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 4,096 SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_32768_SLCK          (SUPC_WUMR_WKUPDBC_32768_SLCK_Val << SUPC_WUMR_WKUPDBC_Pos)  /**< (SUPC_WUMR) WKUPx shall be in its active state for at least 32,768 SLCK periods Position  */
#define SUPC_WUMR_LPDBC_Pos                   (16)                                           /**< (SUPC_WUMR) Low-power Debouncer Period Position */
#define SUPC_WUMR_LPDBC_Msk                   (0x7U << SUPC_WUMR_LPDBC_Pos)                  /**< (SUPC_WUMR) Low-power Debouncer Period Mask */
#define SUPC_WUMR_LPDBC(value)                (SUPC_WUMR_LPDBC_Msk & ((value) << SUPC_WUMR_LPDBC_Pos))
#define   SUPC_WUMR_LPDBC_DISABLE_Val         (0x0U)                                         /**< (SUPC_WUMR) Disables the low-power debouncers.  */
#define   SUPC_WUMR_LPDBC_2_RTCOUT_Val        (0x1U)                                         /**< (SUPC_WUMR) WKUP0/1 in active state for at least 2 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC_3_RTCOUT_Val        (0x2U)                                         /**< (SUPC_WUMR) WKUP0/1 in active state for at least 3 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC_4_RTCOUT_Val        (0x3U)                                         /**< (SUPC_WUMR) WKUP0/1 in active state for at least 4 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC_5_RTCOUT_Val        (0x4U)                                         /**< (SUPC_WUMR) WKUP0/1 in active state for at least 5 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC_6_RTCOUT_Val        (0x5U)                                         /**< (SUPC_WUMR) WKUP0/1 in active state for at least 6 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC_7_RTCOUT_Val        (0x6U)                                         /**< (SUPC_WUMR) WKUP0/1 in active state for at least 7 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC_8_RTCOUT_Val        (0x7U)                                         /**< (SUPC_WUMR) WKUP0/1 in active state for at least 8 RTCOUTx clock periods  */
#define SUPC_WUMR_LPDBC_DISABLE               (SUPC_WUMR_LPDBC_DISABLE_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) Disables the low-power debouncers. Position  */
#define SUPC_WUMR_LPDBC_2_RTCOUT              (SUPC_WUMR_LPDBC_2_RTCOUT_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) WKUP0/1 in active state for at least 2 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC_3_RTCOUT              (SUPC_WUMR_LPDBC_3_RTCOUT_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) WKUP0/1 in active state for at least 3 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC_4_RTCOUT              (SUPC_WUMR_LPDBC_4_RTCOUT_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) WKUP0/1 in active state for at least 4 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC_5_RTCOUT              (SUPC_WUMR_LPDBC_5_RTCOUT_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) WKUP0/1 in active state for at least 5 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC_6_RTCOUT              (SUPC_WUMR_LPDBC_6_RTCOUT_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) WKUP0/1 in active state for at least 6 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC_7_RTCOUT              (SUPC_WUMR_LPDBC_7_RTCOUT_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) WKUP0/1 in active state for at least 7 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC_8_RTCOUT              (SUPC_WUMR_LPDBC_8_RTCOUT_Val << SUPC_WUMR_LPDBC_Pos)  /**< (SUPC_WUMR) WKUP0/1 in active state for at least 8 RTCOUTx clock periods Position  */
#define SUPC_WUMR_Msk                         (0x000770EEUL)                                 /**< (SUPC_WUMR) Register Mask  */
#define SUPC_WUMR_LPDBCEN_Pos                 (5)                                            /**< (SUPC_WUMR Position) Low-power Debouncer Enable WKUPx */
#define SUPC_WUMR_LPDBCEN_Msk                 (0x3U << SUPC_WUMR_LPDBCEN_Pos)                /**< (SUPC_WUMR Mask) LPDBCEN */
#define SUPC_WUMR_LPDBCEN(value)              (SUPC_WUMR_LPDBCEN_Msk & ((value) << SUPC_WUMR_LPDBCEN_Pos))

/* -------- SUPC_WUIR : (SUPC Offset: 0x10) (R/W 32) Supply Controller Wakeup Inputs Register -------- */

typedef union
{
  struct
  {
    uint32_t WKUPEN0:1;                 /**< bit:      0  Wakeup Input Enable 0 to 0                    */
    uint32_t WKUPEN1:1;                 /**< bit:      1  Wakeup Input Enable 0 to 1                    */
    uint32_t WKUPEN2:1;                 /**< bit:      2  Wakeup Input Enable 0 to 2                    */
    uint32_t WKUPEN3:1;                 /**< bit:      3  Wakeup Input Enable 0 to 3                    */
    uint32_t WKUPEN4:1;                 /**< bit:      4  Wakeup Input Enable 0 to 4                    */
    uint32_t WKUPEN5:1;                 /**< bit:      5  Wakeup Input Enable 0 to 5                    */
    uint32_t WKUPEN6:1;                 /**< bit:      6  Wakeup Input Enable 0 to 6                    */
    uint32_t WKUPEN7:1;                 /**< bit:      7  Wakeup Input Enable 0 to 7                    */
    uint32_t WKUPEN8:1;                 /**< bit:      8  Wakeup Input Enable 0 to 8                    */
    uint32_t WKUPEN9:1;                 /**< bit:      9  Wakeup Input Enable 0 to 9                    */
    uint32_t WKUPEN10:1;                /**< bit:     10  Wakeup Input Enable 0 to 10                   */
    uint32_t WKUPEN11:1;                /**< bit:     11  Wakeup Input Enable 0 to 11                   */
    uint32_t WKUPEN12:1;                /**< bit:     12  Wakeup Input Enable 0 to 12                   */
    uint32_t WKUPEN13:1;                /**< bit:     13  Wakeup Input Enable 0 to 13                   */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t WKUPT0:1;                  /**< bit:     16  Wakeup Input Type 0 to 0                      */
    uint32_t WKUPT1:1;                  /**< bit:     17  Wakeup Input Type 0 to 1                      */
    uint32_t WKUPT2:1;                  /**< bit:     18  Wakeup Input Type 0 to 2                      */
    uint32_t WKUPT3:1;                  /**< bit:     19  Wakeup Input Type 0 to 3                      */
    uint32_t WKUPT4:1;                  /**< bit:     20  Wakeup Input Type 0 to 4                      */
    uint32_t WKUPT5:1;                  /**< bit:     21  Wakeup Input Type 0 to 5                      */
    uint32_t WKUPT6:1;                  /**< bit:     22  Wakeup Input Type 0 to 6                      */
    uint32_t WKUPT7:1;                  /**< bit:     23  Wakeup Input Type 0 to 7                      */
    uint32_t WKUPT8:1;                  /**< bit:     24  Wakeup Input Type 0 to 8                      */
    uint32_t WKUPT9:1;                  /**< bit:     25  Wakeup Input Type 0 to 9                      */
    uint32_t WKUPT10:1;                 /**< bit:     26  Wakeup Input Type 0 to 10                     */
    uint32_t WKUPT11:1;                 /**< bit:     27  Wakeup Input Type 0 to 11                     */
    uint32_t WKUPT12:1;                 /**< bit:     28  Wakeup Input Type 0 to 12                     */
    uint32_t WKUPT13:1;                 /**< bit:     29  Wakeup Input Type 0 to 13                     */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  struct
  {
    uint32_t WKUPEN:14;                 /**< bit:  0..13  Wakeup Input Enable x to x                    */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t WKUPT:14;                  /**< bit: 16..29  Wakeup Input Type x to x3                     */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __SUPC_WUIR_bits_t;

