zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/supc.h
#define SUPC_WUIR_WKUPEN0_Pos                 (0)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 0 Position */
#define SUPC_WUIR_WKUPEN0_Msk                 (0x1U << SUPC_WUIR_WKUPEN0_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 0 Mask */
#define   SUPC_WUIR_WKUPEN0_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN0_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN0_DISABLE             (SUPC_WUIR_WKUPEN0_DISABLE_Val << SUPC_WUIR_WKUPEN0_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN0_ENABLE              (SUPC_WUIR_WKUPEN0_ENABLE_Val << SUPC_WUIR_WKUPEN0_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN1_Pos                 (1)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 1 Position */
#define SUPC_WUIR_WKUPEN1_Msk                 (0x1U << SUPC_WUIR_WKUPEN1_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 1 Mask */
#define   SUPC_WUIR_WKUPEN1_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN1_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN1_DISABLE             (SUPC_WUIR_WKUPEN1_DISABLE_Val << SUPC_WUIR_WKUPEN1_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN1_ENABLE              (SUPC_WUIR_WKUPEN1_ENABLE_Val << SUPC_WUIR_WKUPEN1_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN2_Pos                 (2)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 2 Position */
#define SUPC_WUIR_WKUPEN2_Msk                 (0x1U << SUPC_WUIR_WKUPEN2_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 2 Mask */
#define   SUPC_WUIR_WKUPEN2_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN2_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN2_DISABLE             (SUPC_WUIR_WKUPEN2_DISABLE_Val << SUPC_WUIR_WKUPEN2_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN2_ENABLE              (SUPC_WUIR_WKUPEN2_ENABLE_Val << SUPC_WUIR_WKUPEN2_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN3_Pos                 (3)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 3 Position */
#define SUPC_WUIR_WKUPEN3_Msk                 (0x1U << SUPC_WUIR_WKUPEN3_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 3 Mask */
#define   SUPC_WUIR_WKUPEN3_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN3_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN3_DISABLE             (SUPC_WUIR_WKUPEN3_DISABLE_Val << SUPC_WUIR_WKUPEN3_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN3_ENABLE              (SUPC_WUIR_WKUPEN3_ENABLE_Val << SUPC_WUIR_WKUPEN3_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN4_Pos                 (4)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 4 Position */
#define SUPC_WUIR_WKUPEN4_Msk                 (0x1U << SUPC_WUIR_WKUPEN4_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 4 Mask */
#define   SUPC_WUIR_WKUPEN4_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN4_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN4_DISABLE             (SUPC_WUIR_WKUPEN4_DISABLE_Val << SUPC_WUIR_WKUPEN4_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN4_ENABLE              (SUPC_WUIR_WKUPEN4_ENABLE_Val << SUPC_WUIR_WKUPEN4_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN5_Pos                 (5)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 5 Position */
#define SUPC_WUIR_WKUPEN5_Msk                 (0x1U << SUPC_WUIR_WKUPEN5_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 5 Mask */
#define   SUPC_WUIR_WKUPEN5_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN5_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN5_DISABLE             (SUPC_WUIR_WKUPEN5_DISABLE_Val << SUPC_WUIR_WKUPEN5_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN5_ENABLE              (SUPC_WUIR_WKUPEN5_ENABLE_Val << SUPC_WUIR_WKUPEN5_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN6_Pos                 (6)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 6 Position */
#define SUPC_WUIR_WKUPEN6_Msk                 (0x1U << SUPC_WUIR_WKUPEN6_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 6 Mask */
#define   SUPC_WUIR_WKUPEN6_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN6_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN6_DISABLE             (SUPC_WUIR_WKUPEN6_DISABLE_Val << SUPC_WUIR_WKUPEN6_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN6_ENABLE              (SUPC_WUIR_WKUPEN6_ENABLE_Val << SUPC_WUIR_WKUPEN6_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN7_Pos                 (7)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 7 Position */
#define SUPC_WUIR_WKUPEN7_Msk                 (0x1U << SUPC_WUIR_WKUPEN7_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 7 Mask */
#define   SUPC_WUIR_WKUPEN7_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN7_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN7_DISABLE             (SUPC_WUIR_WKUPEN7_DISABLE_Val << SUPC_WUIR_WKUPEN7_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN7_ENABLE              (SUPC_WUIR_WKUPEN7_ENABLE_Val << SUPC_WUIR_WKUPEN7_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN8_Pos                 (8)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 8 Position */
#define SUPC_WUIR_WKUPEN8_Msk                 (0x1U << SUPC_WUIR_WKUPEN8_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 8 Mask */
#define   SUPC_WUIR_WKUPEN8_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN8_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN8_DISABLE             (SUPC_WUIR_WKUPEN8_DISABLE_Val << SUPC_WUIR_WKUPEN8_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN8_ENABLE              (SUPC_WUIR_WKUPEN8_ENABLE_Val << SUPC_WUIR_WKUPEN8_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN9_Pos                 (9)                                            /**< (SUPC_WUIR) Wakeup Input Enable 0 to 9 Position */
#define SUPC_WUIR_WKUPEN9_Msk                 (0x1U << SUPC_WUIR_WKUPEN9_Pos)                /**< (SUPC_WUIR) Wakeup Input Enable 0 to 9 Mask */
#define   SUPC_WUIR_WKUPEN9_DISABLE_Val       (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN9_ENABLE_Val        (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN9_DISABLE             (SUPC_WUIR_WKUPEN9_DISABLE_Val << SUPC_WUIR_WKUPEN9_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN9_ENABLE              (SUPC_WUIR_WKUPEN9_ENABLE_Val << SUPC_WUIR_WKUPEN9_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN10_Pos                (10)                                           /**< (SUPC_WUIR) Wakeup Input Enable 0 to 10 Position */
#define SUPC_WUIR_WKUPEN10_Msk                (0x1U << SUPC_WUIR_WKUPEN10_Pos)               /**< (SUPC_WUIR) Wakeup Input Enable 0 to 10 Mask */
#define   SUPC_WUIR_WKUPEN10_DISABLE_Val      (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN10_ENABLE_Val       (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN10_DISABLE            (SUPC_WUIR_WKUPEN10_DISABLE_Val << SUPC_WUIR_WKUPEN10_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN10_ENABLE             (SUPC_WUIR_WKUPEN10_ENABLE_Val << SUPC_WUIR_WKUPEN10_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN11_Pos                (11)                                           /**< (SUPC_WUIR) Wakeup Input Enable 0 to 11 Position */
#define SUPC_WUIR_WKUPEN11_Msk                (0x1U << SUPC_WUIR_WKUPEN11_Pos)               /**< (SUPC_WUIR) Wakeup Input Enable 0 to 11 Mask */
#define   SUPC_WUIR_WKUPEN11_DISABLE_Val      (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN11_ENABLE_Val       (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN11_DISABLE            (SUPC_WUIR_WKUPEN11_DISABLE_Val << SUPC_WUIR_WKUPEN11_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN11_ENABLE             (SUPC_WUIR_WKUPEN11_ENABLE_Val << SUPC_WUIR_WKUPEN11_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN12_Pos                (12)                                           /**< (SUPC_WUIR) Wakeup Input Enable 0 to 12 Position */
#define SUPC_WUIR_WKUPEN12_Msk                (0x1U << SUPC_WUIR_WKUPEN12_Pos)               /**< (SUPC_WUIR) Wakeup Input Enable 0 to 12 Mask */
#define   SUPC_WUIR_WKUPEN12_DISABLE_Val      (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN12_ENABLE_Val       (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN12_DISABLE            (SUPC_WUIR_WKUPEN12_DISABLE_Val << SUPC_WUIR_WKUPEN12_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN12_ENABLE             (SUPC_WUIR_WKUPEN12_ENABLE_Val << SUPC_WUIR_WKUPEN12_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPEN13_Pos                (13)                                           /**< (SUPC_WUIR) Wakeup Input Enable 0 to 13 Position */
#define SUPC_WUIR_WKUPEN13_Msk                (0x1U << SUPC_WUIR_WKUPEN13_Pos)               /**< (SUPC_WUIR) Wakeup Input Enable 0 to 13 Mask */
#define   SUPC_WUIR_WKUPEN13_DISABLE_Val      (0x0U)                                         /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect.  */
#define   SUPC_WUIR_WKUPEN13_ENABLE_Val       (0x1U)                                         /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPEN13_DISABLE            (SUPC_WUIR_WKUPEN13_DISABLE_Val << SUPC_WUIR_WKUPEN13_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input has no wakeup effect. Position  */
#define SUPC_WUIR_WKUPEN13_ENABLE             (SUPC_WUIR_WKUPEN13_ENABLE_Val << SUPC_WUIR_WKUPEN13_Pos)  /**< (SUPC_WUIR) The corresponding wakeup input is enabled for a wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT0_Pos                  (16)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 0 Position */
#define SUPC_WUIR_WKUPT0_Msk                  (0x1U << SUPC_WUIR_WKUPT0_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 0 Mask */
#define   SUPC_WUIR_WKUPT0_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT0_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT0_LOW                  (SUPC_WUIR_WKUPT0_LOW_Val << SUPC_WUIR_WKUPT0_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT0_HIGH                 (SUPC_WUIR_WKUPT0_HIGH_Val << SUPC_WUIR_WKUPT0_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT1_Pos                  (17)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 1 Position */
#define SUPC_WUIR_WKUPT1_Msk                  (0x1U << SUPC_WUIR_WKUPT1_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 1 Mask */
#define   SUPC_WUIR_WKUPT1_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT1_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT1_LOW                  (SUPC_WUIR_WKUPT1_LOW_Val << SUPC_WUIR_WKUPT1_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT1_HIGH                 (SUPC_WUIR_WKUPT1_HIGH_Val << SUPC_WUIR_WKUPT1_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT2_Pos                  (18)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 2 Position */
#define SUPC_WUIR_WKUPT2_Msk                  (0x1U << SUPC_WUIR_WKUPT2_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 2 Mask */
#define   SUPC_WUIR_WKUPT2_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT2_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT2_LOW                  (SUPC_WUIR_WKUPT2_LOW_Val << SUPC_WUIR_WKUPT2_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT2_HIGH                 (SUPC_WUIR_WKUPT2_HIGH_Val << SUPC_WUIR_WKUPT2_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT3_Pos                  (19)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 3 Position */
#define SUPC_WUIR_WKUPT3_Msk                  (0x1U << SUPC_WUIR_WKUPT3_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 3 Mask */
#define   SUPC_WUIR_WKUPT3_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT3_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT3_LOW                  (SUPC_WUIR_WKUPT3_LOW_Val << SUPC_WUIR_WKUPT3_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT3_HIGH                 (SUPC_WUIR_WKUPT3_HIGH_Val << SUPC_WUIR_WKUPT3_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT4_Pos                  (20)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 4 Position */
#define SUPC_WUIR_WKUPT4_Msk                  (0x1U << SUPC_WUIR_WKUPT4_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 4 Mask */
#define   SUPC_WUIR_WKUPT4_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT4_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT4_LOW                  (SUPC_WUIR_WKUPT4_LOW_Val << SUPC_WUIR_WKUPT4_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT4_HIGH                 (SUPC_WUIR_WKUPT4_HIGH_Val << SUPC_WUIR_WKUPT4_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT5_Pos                  (21)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 5 Position */
#define SUPC_WUIR_WKUPT5_Msk                  (0x1U << SUPC_WUIR_WKUPT5_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 5 Mask */
#define   SUPC_WUIR_WKUPT5_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT5_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT5_LOW                  (SUPC_WUIR_WKUPT5_LOW_Val << SUPC_WUIR_WKUPT5_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT5_HIGH                 (SUPC_WUIR_WKUPT5_HIGH_Val << SUPC_WUIR_WKUPT5_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT6_Pos                  (22)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 6 Position */
#define SUPC_WUIR_WKUPT6_Msk                  (0x1U << SUPC_WUIR_WKUPT6_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 6 Mask */
#define   SUPC_WUIR_WKUPT6_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
