zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/supc.h
#define   SUPC_WUIR_WKUPT6_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT6_LOW                  (SUPC_WUIR_WKUPT6_LOW_Val << SUPC_WUIR_WKUPT6_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT6_HIGH                 (SUPC_WUIR_WKUPT6_HIGH_Val << SUPC_WUIR_WKUPT6_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT7_Pos                  (23)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 7 Position */
#define SUPC_WUIR_WKUPT7_Msk                  (0x1U << SUPC_WUIR_WKUPT7_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 7 Mask */
#define   SUPC_WUIR_WKUPT7_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT7_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT7_LOW                  (SUPC_WUIR_WKUPT7_LOW_Val << SUPC_WUIR_WKUPT7_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT7_HIGH                 (SUPC_WUIR_WKUPT7_HIGH_Val << SUPC_WUIR_WKUPT7_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT8_Pos                  (24)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 8 Position */
#define SUPC_WUIR_WKUPT8_Msk                  (0x1U << SUPC_WUIR_WKUPT8_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 8 Mask */
#define   SUPC_WUIR_WKUPT8_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT8_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT8_LOW                  (SUPC_WUIR_WKUPT8_LOW_Val << SUPC_WUIR_WKUPT8_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT8_HIGH                 (SUPC_WUIR_WKUPT8_HIGH_Val << SUPC_WUIR_WKUPT8_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT9_Pos                  (25)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 9 Position */
#define SUPC_WUIR_WKUPT9_Msk                  (0x1U << SUPC_WUIR_WKUPT9_Pos)                 /**< (SUPC_WUIR) Wakeup Input Type 0 to 9 Mask */
#define   SUPC_WUIR_WKUPT9_LOW_Val            (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT9_HIGH_Val           (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT9_LOW                  (SUPC_WUIR_WKUPT9_LOW_Val << SUPC_WUIR_WKUPT9_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT9_HIGH                 (SUPC_WUIR_WKUPT9_HIGH_Val << SUPC_WUIR_WKUPT9_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT10_Pos                 (26)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 10 Position */
#define SUPC_WUIR_WKUPT10_Msk                 (0x1U << SUPC_WUIR_WKUPT10_Pos)                /**< (SUPC_WUIR) Wakeup Input Type 0 to 10 Mask */
#define   SUPC_WUIR_WKUPT10_LOW_Val           (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT10_HIGH_Val          (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT10_LOW                 (SUPC_WUIR_WKUPT10_LOW_Val << SUPC_WUIR_WKUPT10_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT10_HIGH                (SUPC_WUIR_WKUPT10_HIGH_Val << SUPC_WUIR_WKUPT10_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT11_Pos                 (27)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 11 Position */
#define SUPC_WUIR_WKUPT11_Msk                 (0x1U << SUPC_WUIR_WKUPT11_Pos)                /**< (SUPC_WUIR) Wakeup Input Type 0 to 11 Mask */
#define   SUPC_WUIR_WKUPT11_LOW_Val           (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT11_HIGH_Val          (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT11_LOW                 (SUPC_WUIR_WKUPT11_LOW_Val << SUPC_WUIR_WKUPT11_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT11_HIGH                (SUPC_WUIR_WKUPT11_HIGH_Val << SUPC_WUIR_WKUPT11_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT12_Pos                 (28)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 12 Position */
#define SUPC_WUIR_WKUPT12_Msk                 (0x1U << SUPC_WUIR_WKUPT12_Pos)                /**< (SUPC_WUIR) Wakeup Input Type 0 to 12 Mask */
#define   SUPC_WUIR_WKUPT12_LOW_Val           (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT12_HIGH_Val          (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT12_LOW                 (SUPC_WUIR_WKUPT12_LOW_Val << SUPC_WUIR_WKUPT12_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT12_HIGH                (SUPC_WUIR_WKUPT12_HIGH_Val << SUPC_WUIR_WKUPT12_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT13_Pos                 (29)                                           /**< (SUPC_WUIR) Wakeup Input Type 0 to 13 Position */
#define SUPC_WUIR_WKUPT13_Msk                 (0x1U << SUPC_WUIR_WKUPT13_Pos)                /**< (SUPC_WUIR) Wakeup Input Type 0 to 13 Mask */
#define   SUPC_WUIR_WKUPT13_LOW_Val           (0x0U)                                         /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply.  */
#define   SUPC_WUIR_WKUPT13_HIGH_Val          (0x1U)                                         /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply.  */
#define SUPC_WUIR_WKUPT13_LOW                 (SUPC_WUIR_WKUPT13_LOW_Val << SUPC_WUIR_WKUPT13_Pos)  /**< (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_WKUPT13_HIGH                (SUPC_WUIR_WKUPT13_HIGH_Val << SUPC_WUIR_WKUPT13_Pos)  /**< (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wakeup input forces the wakeup of the core power supply. Position  */
#define SUPC_WUIR_Msk                         (0x3FFF3FFFUL)                                 /**< (SUPC_WUIR) Register Mask  */
#define SUPC_WUIR_WKUPEN_Pos                  (0)                                            /**< (SUPC_WUIR Position) Wakeup Input Enable x to x */
#define SUPC_WUIR_WKUPEN_Msk                  (0x3FFFU << SUPC_WUIR_WKUPEN_Pos)              /**< (SUPC_WUIR Mask) WKUPEN */
#define SUPC_WUIR_WKUPEN(value)               (SUPC_WUIR_WKUPEN_Msk & ((value) << SUPC_WUIR_WKUPEN_Pos))
#define SUPC_WUIR_WKUPT_Pos                   (16)                                           /**< (SUPC_WUIR Position) Wakeup Input Type x to x3 */
#define SUPC_WUIR_WKUPT_Msk                   (0x3FFFU << SUPC_WUIR_WKUPT_Pos)               /**< (SUPC_WUIR Mask) WKUPT */
#define SUPC_WUIR_WKUPT(value)                (SUPC_WUIR_WKUPT_Msk & ((value) << SUPC_WUIR_WKUPT_Pos))

/* -------- SUPC_SR : (SUPC Offset: 0x14) (R/ 32) Supply Controller Status Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t WKUPS:1;                   /**< bit:      1  WKUP Wakeup Status (cleared on read)          */
    uint32_t SMWS:1;                    /**< bit:      2  Supply Monitor Detection Wakeup Status (cleared on read) */
    uint32_t BODRSTS:1;                 /**< bit:      3  Brownout Detector Reset Status (cleared on read) */
    uint32_t SMRSTS:1;                  /**< bit:      4  Supply Monitor Reset Status (cleared on read) */
    uint32_t SMS:1;                     /**< bit:      5  Supply Monitor Status (cleared on read)       */
    uint32_t SMOS:1;                    /**< bit:      6  Supply Monitor Output Status                  */
    uint32_t OSCSEL:1;                  /**< bit:      7  32-kHz Oscillator Selection Status            */
    uint32_t :5;                        /**< bit:  8..12  Reserved                                      */
    uint32_t LPDBCS0:1;                 /**< bit:     13  Low-power Debouncer Wakeup Status on WKUP0 (cleared on read) */
    uint32_t LPDBCS1:1;                 /**< bit:     14  Low-power Debouncer Wakeup Status on WKUP1 (cleared on read) */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t WKUPIS0:1;                 /**< bit:     16  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS1:1;                 /**< bit:     17  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS2:1;                 /**< bit:     18  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS3:1;                 /**< bit:     19  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS4:1;                 /**< bit:     20  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS5:1;                 /**< bit:     21  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS6:1;                 /**< bit:     22  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS7:1;                 /**< bit:     23  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS8:1;                 /**< bit:     24  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS9:1;                 /**< bit:     25  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS10:1;                /**< bit:     26  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS11:1;                /**< bit:     27  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS12:1;                /**< bit:     28  WKUPx Input Status (cleared on read)          */
    uint32_t WKUPIS13:1;                /**< bit:     29  WKUPx Input Status (cleared on read)          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  struct
  {
    uint32_t :13;                       /**< bit:  0..12  Reserved                                      */
    uint32_t LPDBCS:2;                  /**< bit: 13..14  Low-power Debouncer Wakeup Status on WKUPx (cleared on read) */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t WKUPIS:14;                 /**< bit: 16..29  WKUPx Input Status (cleared on read)          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __SUPC_SR_bits_t;

