zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/supc.h
#define SUPC_SR_WKUPS_Pos                     (1)                                            /**< (SUPC_SR) WKUP Wakeup Status (cleared on read) Position */
#define SUPC_SR_WKUPS_Msk                     (0x1U << SUPC_SR_WKUPS_Pos)                    /**< (SUPC_SR) WKUP Wakeup Status (cleared on read) Mask */
#define   SUPC_SR_WKUPS_NO_Val                (0x0U)                                         /**< (SUPC_SR) No wakeup due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR.  */
#define   SUPC_SR_WKUPS_PRESENT_Val           (0x1U)                                         /**< (SUPC_SR) At least one wakeup due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPS_NO                      (SUPC_SR_WKUPS_NO_Val << SUPC_SR_WKUPS_Pos)    /**< (SUPC_SR) No wakeup due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPS_PRESENT                 (SUPC_SR_WKUPS_PRESENT_Val << SUPC_SR_WKUPS_Pos)  /**< (SUPC_SR) At least one wakeup due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_SMWS_Pos                      (2)                                            /**< (SUPC_SR) Supply Monitor Detection Wakeup Status (cleared on read) Position */
#define SUPC_SR_SMWS_Msk                      (0x1U << SUPC_SR_SMWS_Pos)                     /**< (SUPC_SR) Supply Monitor Detection Wakeup Status (cleared on read) Mask */
#define   SUPC_SR_SMWS_NO_Val                 (0x0U)                                         /**< (SUPC_SR) No wakeup due to a supply monitor detection has occurred since the last read of SUPC_SR.  */
#define   SUPC_SR_SMWS_PRESENT_Val            (0x1U)                                         /**< (SUPC_SR) At least one wakeup due to a supply monitor detection has occurred since the last read of SUPC_SR.  */
#define SUPC_SR_SMWS_NO                       (SUPC_SR_SMWS_NO_Val << SUPC_SR_SMWS_Pos)      /**< (SUPC_SR) No wakeup due to a supply monitor detection has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_SMWS_PRESENT                  (SUPC_SR_SMWS_PRESENT_Val << SUPC_SR_SMWS_Pos)  /**< (SUPC_SR) At least one wakeup due to a supply monitor detection has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_BODRSTS_Pos                   (3)                                            /**< (SUPC_SR) Brownout Detector Reset Status (cleared on read) Position */
#define SUPC_SR_BODRSTS_Msk                   (0x1U << SUPC_SR_BODRSTS_Pos)                  /**< (SUPC_SR) Brownout Detector Reset Status (cleared on read) Mask */
#define   SUPC_SR_BODRSTS_NO_Val              (0x0U)                                         /**< (SUPC_SR) No core brownout rising edge event has been detected since the last read of the SUPC_SR.  */
#define   SUPC_SR_BODRSTS_PRESENT_Val         (0x1U)                                         /**< (SUPC_SR) At least one brownout output rising edge event has been detected since the last read of the SUPC_SR.  */
#define SUPC_SR_BODRSTS_NO                    (SUPC_SR_BODRSTS_NO_Val << SUPC_SR_BODRSTS_Pos)  /**< (SUPC_SR) No core brownout rising edge event has been detected since the last read of the SUPC_SR. Position  */
#define SUPC_SR_BODRSTS_PRESENT               (SUPC_SR_BODRSTS_PRESENT_Val << SUPC_SR_BODRSTS_Pos)  /**< (SUPC_SR) At least one brownout output rising edge event has been detected since the last read of the SUPC_SR. Position  */
#define SUPC_SR_SMRSTS_Pos                    (4)                                            /**< (SUPC_SR) Supply Monitor Reset Status (cleared on read) Position */
#define SUPC_SR_SMRSTS_Msk                    (0x1U << SUPC_SR_SMRSTS_Pos)                   /**< (SUPC_SR) Supply Monitor Reset Status (cleared on read) Mask */
#define   SUPC_SR_SMRSTS_NO_Val               (0x0U)                                         /**< (SUPC_SR) No supply monitor detection has generated a core reset since the last read of the SUPC_SR.  */
#define   SUPC_SR_SMRSTS_PRESENT_Val          (0x1U)                                         /**< (SUPC_SR) At least one supply monitor detection has generated a core reset since the last read of the SUPC_SR.  */
#define SUPC_SR_SMRSTS_NO                     (SUPC_SR_SMRSTS_NO_Val << SUPC_SR_SMRSTS_Pos)  /**< (SUPC_SR) No supply monitor detection has generated a core reset since the last read of the SUPC_SR. Position  */
#define SUPC_SR_SMRSTS_PRESENT                (SUPC_SR_SMRSTS_PRESENT_Val << SUPC_SR_SMRSTS_Pos)  /**< (SUPC_SR) At least one supply monitor detection has generated a core reset since the last read of the SUPC_SR. Position  */
#define SUPC_SR_SMS_Pos                       (5)                                            /**< (SUPC_SR) Supply Monitor Status (cleared on read) Position */
#define SUPC_SR_SMS_Msk                       (0x1U << SUPC_SR_SMS_Pos)                      /**< (SUPC_SR) Supply Monitor Status (cleared on read) Mask */
#define   SUPC_SR_SMS_NO_Val                  (0x0U)                                         /**< (SUPC_SR) No supply monitor detection since the last read of SUPC_SR.  */
#define   SUPC_SR_SMS_PRESENT_Val             (0x1U)                                         /**< (SUPC_SR) At least one supply monitor detection since the last read of SUPC_SR.  */
#define SUPC_SR_SMS_NO                        (SUPC_SR_SMS_NO_Val << SUPC_SR_SMS_Pos)        /**< (SUPC_SR) No supply monitor detection since the last read of SUPC_SR. Position  */
#define SUPC_SR_SMS_PRESENT                   (SUPC_SR_SMS_PRESENT_Val << SUPC_SR_SMS_Pos)   /**< (SUPC_SR) At least one supply monitor detection since the last read of SUPC_SR. Position  */
#define SUPC_SR_SMOS_Pos                      (6)                                            /**< (SUPC_SR) Supply Monitor Output Status Position */
#define SUPC_SR_SMOS_Msk                      (0x1U << SUPC_SR_SMOS_Pos)                     /**< (SUPC_SR) Supply Monitor Output Status Mask */
#define   SUPC_SR_SMOS_HIGH_Val               (0x0U)                                         /**< (SUPC_SR) The supply monitor detected VDDIO higher than its threshold at its last measurement.  */
#define   SUPC_SR_SMOS_LOW_Val                (0x1U)                                         /**< (SUPC_SR) The supply monitor detected VDDIO lower than its threshold at its last measurement.  */
#define SUPC_SR_SMOS_HIGH                     (SUPC_SR_SMOS_HIGH_Val << SUPC_SR_SMOS_Pos)    /**< (SUPC_SR) The supply monitor detected VDDIO higher than its threshold at its last measurement. Position  */
#define SUPC_SR_SMOS_LOW                      (SUPC_SR_SMOS_LOW_Val << SUPC_SR_SMOS_Pos)     /**< (SUPC_SR) The supply monitor detected VDDIO lower than its threshold at its last measurement. Position  */
#define SUPC_SR_OSCSEL_Pos                    (7)                                            /**< (SUPC_SR) 32-kHz Oscillator Selection Status Position */
#define SUPC_SR_OSCSEL_Msk                    (0x1U << SUPC_SR_OSCSEL_Pos)                   /**< (SUPC_SR) 32-kHz Oscillator Selection Status Mask */
#define   SUPC_SR_OSCSEL_RC_Val               (0x0U)                                         /**< (SUPC_SR) The slow clock, SLCK, is generated by the embedded 32 kHz RC oscillator.  */
#define   SUPC_SR_OSCSEL_CRYST_Val            (0x1U)                                         /**< (SUPC_SR) The slow clock, SLCK, is generated by the 32 kHz crystal oscillator.  */
#define SUPC_SR_OSCSEL_RC                     (SUPC_SR_OSCSEL_RC_Val << SUPC_SR_OSCSEL_Pos)  /**< (SUPC_SR) The slow clock, SLCK, is generated by the embedded 32 kHz RC oscillator. Position  */
#define SUPC_SR_OSCSEL_CRYST                  (SUPC_SR_OSCSEL_CRYST_Val << SUPC_SR_OSCSEL_Pos)  /**< (SUPC_SR) The slow clock, SLCK, is generated by the 32 kHz crystal oscillator. Position  */
#define SUPC_SR_LPDBCS0_Pos                   (13)                                           /**< (SUPC_SR) Low-power Debouncer Wakeup Status on WKUP0 (cleared on read) Position */
#define SUPC_SR_LPDBCS0_Msk                   (0x1U << SUPC_SR_LPDBCS0_Pos)                  /**< (SUPC_SR) Low-power Debouncer Wakeup Status on WKUP0 (cleared on read) Mask */
#define   SUPC_SR_LPDBCS0_NO_Val              (0x0U)                                         /**< (SUPC_SR) No wakeup due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR.  */
#define   SUPC_SR_LPDBCS0_PRESENT_Val         (0x1U)                                         /**< (SUPC_SR) At least one wakeup due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR.  */
#define SUPC_SR_LPDBCS0_NO                    (SUPC_SR_LPDBCS0_NO_Val << SUPC_SR_LPDBCS0_Pos)  /**< (SUPC_SR) No wakeup due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_LPDBCS0_PRESENT               (SUPC_SR_LPDBCS0_PRESENT_Val << SUPC_SR_LPDBCS0_Pos)  /**< (SUPC_SR) At least one wakeup due to the assertion of the WKUP0 pin has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_LPDBCS1_Pos                   (14)                                           /**< (SUPC_SR) Low-power Debouncer Wakeup Status on WKUP1 (cleared on read) Position */
#define SUPC_SR_LPDBCS1_Msk                   (0x1U << SUPC_SR_LPDBCS1_Pos)                  /**< (SUPC_SR) Low-power Debouncer Wakeup Status on WKUP1 (cleared on read) Mask */
#define   SUPC_SR_LPDBCS1_NO_Val              (0x0U)                                         /**< (SUPC_SR) No wakeup due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR.  */
#define   SUPC_SR_LPDBCS1_PRESENT_Val         (0x1U)                                         /**< (SUPC_SR) At least one wakeup due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR.  */
#define SUPC_SR_LPDBCS1_NO                    (SUPC_SR_LPDBCS1_NO_Val << SUPC_SR_LPDBCS1_Pos)  /**< (SUPC_SR) No wakeup due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_LPDBCS1_PRESENT               (SUPC_SR_LPDBCS1_PRESENT_Val << SUPC_SR_LPDBCS1_Pos)  /**< (SUPC_SR) At least one wakeup due to the assertion of the WKUP1 pin has occurred since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS0_Pos                   (16)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS0_Msk                   (0x1U << SUPC_SR_WKUPIS0_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS0_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS0_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS0_DIS                   (SUPC_SR_WKUPIS0_DIS_Val << SUPC_SR_WKUPIS0_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS0_EN                    (SUPC_SR_WKUPIS0_EN_Val << SUPC_SR_WKUPIS0_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS1_Pos                   (17)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS1_Msk                   (0x1U << SUPC_SR_WKUPIS1_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS1_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS1_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS1_DIS                   (SUPC_SR_WKUPIS1_DIS_Val << SUPC_SR_WKUPIS1_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS1_EN                    (SUPC_SR_WKUPIS1_EN_Val << SUPC_SR_WKUPIS1_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS2_Pos                   (18)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS2_Msk                   (0x1U << SUPC_SR_WKUPIS2_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS2_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS2_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS2_DIS                   (SUPC_SR_WKUPIS2_DIS_Val << SUPC_SR_WKUPIS2_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS2_EN                    (SUPC_SR_WKUPIS2_EN_Val << SUPC_SR_WKUPIS2_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS3_Pos                   (19)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS3_Msk                   (0x1U << SUPC_SR_WKUPIS3_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS3_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS3_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS3_DIS                   (SUPC_SR_WKUPIS3_DIS_Val << SUPC_SR_WKUPIS3_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS3_EN                    (SUPC_SR_WKUPIS3_EN_Val << SUPC_SR_WKUPIS3_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS4_Pos                   (20)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS4_Msk                   (0x1U << SUPC_SR_WKUPIS4_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS4_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS4_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS4_DIS                   (SUPC_SR_WKUPIS4_DIS_Val << SUPC_SR_WKUPIS4_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS4_EN                    (SUPC_SR_WKUPIS4_EN_Val << SUPC_SR_WKUPIS4_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS5_Pos                   (21)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS5_Msk                   (0x1U << SUPC_SR_WKUPIS5_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS5_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS5_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS5_DIS                   (SUPC_SR_WKUPIS5_DIS_Val << SUPC_SR_WKUPIS5_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS5_EN                    (SUPC_SR_WKUPIS5_EN_Val << SUPC_SR_WKUPIS5_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS6_Pos                   (22)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS6_Msk                   (0x1U << SUPC_SR_WKUPIS6_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS6_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS6_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS6_DIS                   (SUPC_SR_WKUPIS6_DIS_Val << SUPC_SR_WKUPIS6_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS6_EN                    (SUPC_SR_WKUPIS6_EN_Val << SUPC_SR_WKUPIS6_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS7_Pos                   (23)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS7_Msk                   (0x1U << SUPC_SR_WKUPIS7_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS7_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS7_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS7_DIS                   (SUPC_SR_WKUPIS7_DIS_Val << SUPC_SR_WKUPIS7_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS7_EN                    (SUPC_SR_WKUPIS7_EN_Val << SUPC_SR_WKUPIS7_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS8_Pos                   (24)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS8_Msk                   (0x1U << SUPC_SR_WKUPIS8_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS8_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS8_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS8_DIS                   (SUPC_SR_WKUPIS8_DIS_Val << SUPC_SR_WKUPIS8_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS8_EN                    (SUPC_SR_WKUPIS8_EN_Val << SUPC_SR_WKUPIS8_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS9_Pos                   (25)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS9_Msk                   (0x1U << SUPC_SR_WKUPIS9_Pos)                  /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS9_DIS_Val             (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS9_EN_Val              (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS9_DIS                   (SUPC_SR_WKUPIS9_DIS_Val << SUPC_SR_WKUPIS9_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS9_EN                    (SUPC_SR_WKUPIS9_EN_Val << SUPC_SR_WKUPIS9_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS10_Pos                  (26)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS10_Msk                  (0x1U << SUPC_SR_WKUPIS10_Pos)                 /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS10_DIS_Val            (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS10_EN_Val             (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
