zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/supc.h
#define SUPC_SR_WKUPIS10_DIS                  (SUPC_SR_WKUPIS10_DIS_Val << SUPC_SR_WKUPIS10_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS10_EN                   (SUPC_SR_WKUPIS10_EN_Val << SUPC_SR_WKUPIS10_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS11_Pos                  (27)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS11_Msk                  (0x1U << SUPC_SR_WKUPIS11_Pos)                 /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS11_DIS_Val            (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS11_EN_Val             (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS11_DIS                  (SUPC_SR_WKUPIS11_DIS_Val << SUPC_SR_WKUPIS11_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS11_EN                   (SUPC_SR_WKUPIS11_EN_Val << SUPC_SR_WKUPIS11_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS12_Pos                  (28)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS12_Msk                  (0x1U << SUPC_SR_WKUPIS12_Pos)                 /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS12_DIS_Val            (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS12_EN_Val             (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS12_DIS                  (SUPC_SR_WKUPIS12_DIS_Val << SUPC_SR_WKUPIS12_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS12_EN                   (SUPC_SR_WKUPIS12_EN_Val << SUPC_SR_WKUPIS12_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_WKUPIS13_Pos                  (29)                                           /**< (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS13_Msk                  (0x1U << SUPC_SR_WKUPIS13_Pos)                 /**< (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define   SUPC_SR_WKUPIS13_DIS_Val            (0x0U)                                         /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.  */
#define   SUPC_SR_WKUPIS13_EN_Val             (0x1U)                                         /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS13_DIS                  (SUPC_SR_WKUPIS13_DIS_Val << SUPC_SR_WKUPIS13_Pos)  /**< (SUPC_SR) The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event. Position  */
#define SUPC_SR_WKUPIS13_EN                   (SUPC_SR_WKUPIS13_EN_Val << SUPC_SR_WKUPIS13_Pos)  /**< (SUPC_SR) The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR. Position  */
#define SUPC_SR_Msk                           (0x3FFF60FEUL)                                 /**< (SUPC_SR) Register Mask  */
#define SUPC_SR_LPDBCS_Pos                    (13)                                           /**< (SUPC_SR Position) Low-power Debouncer Wakeup Status on WKUPx (cleared on read) */
#define SUPC_SR_LPDBCS_Msk                    (0x3U << SUPC_SR_LPDBCS_Pos)                   /**< (SUPC_SR Mask) LPDBCS */
#define SUPC_SR_LPDBCS(value)                 (SUPC_SR_LPDBCS_Msk & ((value) << SUPC_SR_LPDBCS_Pos))
#define SUPC_SR_WKUPIS_Pos                    (16)                                           /**< (SUPC_SR Position) WKUPx Input Status (cleared on read) */
#define SUPC_SR_WKUPIS_Msk                    (0x3FFFU << SUPC_SR_WKUPIS_Pos)                /**< (SUPC_SR Mask) WKUPIS */
#define SUPC_SR_WKUPIS(value)                 (SUPC_SR_WKUPIS_Msk & ((value) << SUPC_SR_WKUPIS_Pos))

/** \brief SUPC register offsets definitions */
#define SUPC_CR_OFFSET               (0x00)         /**< (SUPC_CR) Supply Controller Control Register Offset */
#define SUPC_SMMR_OFFSET             (0x04)         /**< (SUPC_SMMR) Supply Controller Supply Monitor Mode Register Offset */
#define SUPC_MR_OFFSET               (0x08)         /**< (SUPC_MR) Supply Controller Mode Register Offset */
#define SUPC_WUMR_OFFSET             (0x0C)         /**< (SUPC_WUMR) Supply Controller Wakeup Mode Register Offset */
#define SUPC_WUIR_OFFSET             (0x10)         /**< (SUPC_WUIR) Supply Controller Wakeup Inputs Register Offset */
#define SUPC_SR_OFFSET               (0x14)         /**< (SUPC_SR) Supply Controller Status Register Offset */

/** \brief SUPC register API structure */
typedef struct
{
  __O   __SUPC_CR_bits_t               SUPC_CR;       /**< Offset: 0x00 ( /W  32) Supply Controller Control Register */
  __IO  __SUPC_SMMR_bits_t             SUPC_SMMR;     /**< Offset: 0x04 (R/W  32) Supply Controller Supply Monitor Mode Register */
  __IO  __SUPC_MR_bits_t               SUPC_MR;       /**< Offset: 0x08 (R/W  32) Supply Controller Mode Register */
  __IO  __SUPC_WUMR_bits_t             SUPC_WUMR;     /**< Offset: 0x0C (R/W  32) Supply Controller Wakeup Mode Register */
  __IO  __SUPC_WUIR_bits_t             SUPC_WUIR;     /**< Offset: 0x10 (R/W  32) Supply Controller Wakeup Inputs Register */
  __I   __SUPC_SR_bits_t               SUPC_SR;       /**< Offset: 0x14 (R/   32) Supply Controller Status Register */
} supc_registers_t;
/** @}  end of Supply Controller */

#endif /* _PIC32CZ_CA70_SUPC_COMPONENT_H_ */
